{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"identity_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}]}}, "identity_3": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_49/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_50/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_47/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_48/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_45/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_46/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_43/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_44/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_41/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_42/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_39/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_40/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_37/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_38/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_35/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_36/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_34/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/constant_values", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/global_average_pooling2d_13/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.transpose_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_41/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_41/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_42/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_42/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_43/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_43/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_44/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_44/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_47/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_47/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_45/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_58/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_45/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_46/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_58/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_46/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_48/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_48/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_49/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_49/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_52/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_59/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_52/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_50/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_50/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_59/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_51/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_51/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_53/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_53/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_54/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_54/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_57/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_57/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_55/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv2d_55/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_34/Pad", "op": "Pad", "input": ["args_0", "StatefulPartitionedCall/model_1/zero_padding2d_34/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_18/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_34/Pad", "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2", "op": "PadV2", "input": ["StatefulPartitionedCall/model_1/re_lu_18/Relu", "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/paddings", "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/constant_values"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2"], "attr": {"ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_35/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/model_1/zero_padding2d_35/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_19/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_35/Pad", "StatefulPartitionedCall/model_1/conv2d_41/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_41/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_36/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_19/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_36/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_36/Pad", "StatefulPartitionedCall/model_1/conv2d_42/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_42/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_8/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3", "StatefulPartitionedCall/model_1/max_pooling2d_2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_19/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_8/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_37/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_19/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_37/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_20/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_37/Pad", "StatefulPartitionedCall/model_1/conv2d_43/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_43/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_38/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_20/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_38/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_38/Pad", "StatefulPartitionedCall/model_1/conv2d_44/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_44/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_9/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3", "StatefulPartitionedCall/model_1/re_lu_19/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_20/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_9/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_39/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_20/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_39/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/re_lu_20/Relu_1", "StatefulPartitionedCall/model_1/conv2d_47/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_47/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_21/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_39/Pad", "StatefulPartitionedCall/model_1/conv2d_45/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_45/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_40/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_21/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_40/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_40/Pad", "StatefulPartitionedCall/model_1/conv2d_46/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_46/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_10/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3", "StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_21/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_10/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_41/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_21/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_41/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_22/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_41/Pad", "StatefulPartitionedCall/model_1/conv2d_48/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_48/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_42/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_22/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_42/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_42/Pad", "StatefulPartitionedCall/model_1/conv2d_49/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_49/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_11/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3", "StatefulPartitionedCall/model_1/re_lu_21/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_22/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_11/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_43/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_22/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_43/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/re_lu_22/Relu_1", "StatefulPartitionedCall/model_1/conv2d_52/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_52/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_23/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_43/Pad", "StatefulPartitionedCall/model_1/conv2d_50/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_50/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_44/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_23/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_44/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_44/Pad", "StatefulPartitionedCall/model_1/conv2d_51/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_51/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_12/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3", "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_23/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_12/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_45/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_23/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_45/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_24/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_45/Pad", "StatefulPartitionedCall/model_1/conv2d_53/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_53/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_46/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_24/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_46/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_46/Pad", "StatefulPartitionedCall/model_1/conv2d_54/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_54/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_13/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3", "StatefulPartitionedCall/model_1/re_lu_23/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_24/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_13/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_47/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_24/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_47/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/re_lu_24/Relu_1", "StatefulPartitionedCall/model_1/conv2d_57/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_57/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_25/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_47/Pad", "StatefulPartitionedCall/model_1/conv2d_55/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_55/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_48/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_25/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_48/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_48/Pad", "StatefulPartitionedCall/model_1/conv2d_56/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_56/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_14/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3", "StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_25/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_14/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_49/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_25/Relu_1", "StatefulPartitionedCall/model_1/zero_padding2d_49/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_26/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_49/Pad", "StatefulPartitionedCall/model_1/conv2d_58/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_58/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_50/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_1/re_lu_26/Relu", "StatefulPartitionedCall/model_1/zero_padding2d_50/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_59/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_1/zero_padding2d_50/Pad", "StatefulPartitionedCall/model_1/conv2d_59/Conv2D_weights", "StatefulPartitionedCall/model_1/conv2d_59/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/tf.__operators__.add_15/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_59/FusedBatchNormV3", "StatefulPartitionedCall/model_1/re_lu_25/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/re_lu_26/Relu_1", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/tf.__operators__.add_15/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/global_average_pooling2d_13/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_1/re_lu_26/Relu_1", "StatefulPartitionedCall/model_1/global_average_pooling2d_13/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.transpose_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model_1/global_average_pooling2d_13/Mean", "StatefulPartitionedCall/model_1/tf.compat.v1.transpose_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/tf.reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/tf.compat.v1.transpose_1/transpose", "StatefulPartitionedCall/model_1/tf.reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/tf.nn.relu_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/tf.reshape_1/Reshape", "StatefulPartitionedCall/model_1/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_8/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/tf.nn.relu_1/Relu", "StatefulPartitionedCall/model_1/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/dense_7/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_1/tf.nn.relu_1/Relu", "StatefulPartitionedCall/model_1/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_1/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/dense_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/dense_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/model_1/dense_7/MatMul/ReadVariableOp", "shape": [128, 5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15277711082907286, "scale": 0.0011316823024375767, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/dense_7/BiasAdd/ReadVariableOp", "shape": [5], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09795419380945318, "scale": 0.0008029032279463376, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_49/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_50/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_47/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_48/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_45/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_46/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_43/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_44/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_41/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_42/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_39/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_40/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_37/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_38/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_35/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_36/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/zero_padding2d_34/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.pad_1/PadV2/constant_values", "shape": [], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -10000000000000000, "scale": 1.0, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/global_average_pooling2d_13/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.compat.v1.transpose_1/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/tf.reshape_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/dense_6/MatMul/ReadVariableOp", "shape": [512, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.668211581660252, "scale": 0.00596617483625225, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/dense_6/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09141169003411835, "scale": 0.0017247488685682708, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/dense_8/MatMul/ReadVariableOp", "shape": [128, 4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9771083394686381, "scale": 0.0114953922290428, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/dense_8/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.016398755833506584, "scale": 0.0033365061543151444, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_weights", "shape": [7, 7, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3753346834696975, "scale": 0.003507800780090631, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/conv2d_40/Conv2D_bn_offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6240699235130759, "scale": 0.006710429285086837, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/conv2d_41/Conv2D_weights", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2468293329079946, "scale": 0.002023191253344218, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/model_1/conv2d_56/Conv2D_weights", "shape": [3, 3, 512, 512], 